; domain
; PDDL domain problem: NO axioms integration! The axioms have been COMPLETELY moved into the ASP file.

(define (domain dntp)
  (:requirements :strips :typing :equality :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions)
  (:types
    node - object
    primary secondary - node
  )
  (:predicates
    (conn  ?x - node ?y - node)
    (close ?x - node ?y - node)
    (rem   ?x - node ?y - node)
    (full  ?x - secondary)
    (buildable ?x - node ?y - node)
    (mutable   ?x - node ?y - node)
    (le        ?x - node ?y - node)
  )

  (:action insP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (buildable ?s ?p) (not (conn ?s ?p)) (not (rem ?s ?p)) (not (full ?s)))
    :effect (and (conn ?s ?p) (not (close ?s ?p)) (full ?s)))
  (:action insS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (buildable ?s1 ?s2) (not (conn ?s1 ?s2)) (not (rem ?s1 ?s2)) (not (full ?s1)) (not (full ?s2)))
    :effect (and (conn ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2)))
  (:action delP
    :parameters (?s - secondary ?p - primary)
    :precondition (and (conn ?s ?p) (mutable ?s ?p) (not (close ?s ?p)) (full ?s))
    :effect (and (not (conn ?s ?p)) (rem ?s ?p) (not (full ?s))))
  (:action delS
    :parameters (?s1 - secondary ?s2 - secondary)
    :precondition (and (le ?s1 ?s2) (conn ?s1 ?s2) (mutable ?s1 ?s2) (not (close ?s1 ?s2)) (full ?s1) (full ?s2))
    :effect (and (not (conn ?s1 ?s2)) (rem ?s1 ?s2) (not (full ?s1)) (not (full ?s2))))
  (:action sw
    :parameters (?u - secondary ?v - node ?vp - node)
    :precondition (and (not (= ?u ?v)) (not (= ?u ?vp)) (not (= ?v ?vp))
      (imply (le ?u ?v)  (and (conn ?u ?v) (close ?u ?v)))
      (imply (le ?v ?u)  (and (conn ?v ?u) (close ?v ?u)))
      (imply (le ?u ?vp) (and (conn ?u ?vp) (not (close ?u ?vp))))
      (imply (le ?vp ?u) (and (conn ?vp ?u) (not (close ?vp ?u)))))
    :effect (and
      (when (le ?u ?v)  (not (close ?u ?v)))
      (when (le ?v ?u)  (not (close ?v ?u)))
      (when (le ?u ?vp) (close ?u ?vp))
      (when (le ?vp ?u) (close ?vp ?u))))
)

; problem
(define (problem disnet68n) (:domain dntp)
(:objects
	S1 S2 S3 S4 S5 S6 - secondary
	P7 P8 - primary
)
(:init
	(conn S1 P7)
	(conn S1 S2)
	(conn S2 P8)
	(conn S3 P7)
	(conn S3 S4)
	(conn S4 S5)
	(conn S5 S6)
	(conn S6 P8)
	(close S1 P7)
	(close S2 P8)
	(close S3 P7)
	(close S3 S4)
	(close S5 S6)
	(close S6 P8)
	(buildable S1 S4)
	(buildable S2 S4)
	(buildable S3 S5)
	(mutable S1 S2)
	(mutable S3 S4)
	(mutable S4 S5)
	(le P7 P8)
	(le S1 P7)
	(le S1 P8)
	(le S1 S2)
	(le S1 S3)
	(le S1 S4)
	(le S1 S5)
	(le S1 S6)
	(le S2 P7)
	(le S2 P8)
	(le S2 S3)
	(le S2 S4)
	(le S2 S5)
	(le S2 S6)
	(le S3 P7)
	(le S3 P8)
	(le S3 S4)
	(le S3 S5)
	(le S3 S6)
	(le S4 P7)
	(le S4 P8)
	(le S4 S5)
	(le S4 S6)
	(le S5 P7)
	(le S5 P8)
	(le S5 S6)
	(le S6 P7)
	(le S6 P8)
)
(:goal
	(and
		(conn S1 P7)
		(conn S1 S4)
		(conn S2 P8)
		(conn S2 S4)
		(conn S3 P7)
		(conn S3 S5)
		(conn S5 S6)
		(conn S6 P8)
		(not (conn S1 S2))
		(not (conn S3 S4))
		(not (conn S4 S5))
		(close S1 P7)
		(close S1 S4)
		(close S2 P8)
		(close S3 P7)
		(close S5 S6)
		(close S6 P8)
		(not (close S2 S4))
		(not (close S3 S5))

	)
)
)

; plan
1. (inss s1 s4)
   added: (conn s1 s4) (full s1) (full s4)
   goals met: 13 of 19
2. (sw s4 s3 s1)
   deleted: (close s3 s4)
   added: (close s1 s4)
   goals met: 14 of 19
3. (inss s3 s5)
   added: (conn s3 s5) (full s3) (full s5)
   goals met: 15 of 19
4. (dels s3 s4)
   deleted: (conn s3 s4) (full s3) (full s4)
   added: (rem s3 s4)
   goals met: 16 of 19
5. (inss s2 s4)
   added: (conn s2 s4) (full s2) (full s4)
   goals met: 17 of 19
6. (dels s1 s2)
   deleted: (conn s1 s2) (full s1) (full s2)
   added: (rem s1 s2)
   goals met: 18 of 19
7. (dels s4 s5)
   deleted: (conn s4 s5) (full s4) (full s5)
   added: (rem s4 s5)
   goals met: 19 of 19
